# Файл содержит словари и шаблоны для правильной транслитерации из кирилицы в латиницу
# шаблоны используемые в файле translit.py
repl_map = {
        ',': '_',
        '/': '-',
        ' ': '_',
        '(': '_',
        ')': '_',
        ':': '',
        '.': '',
        '\n': '_',
        '___': '_',
        '__': '_',
        '\t': '_',
        '«': '',
        '»': '',
        '{': '',
        '}': '',
        '_': '_',
    }

translit_dict = {
        'а':'a','б':'b','в':'v','г':'g','д':'d',
        'е':'e','ё':'yo','ж':'zh','з':'z','и':'i',
        'й':'j','к':'k','л':'l','м':'m','н':'n',
        'о':'o','п':'p','р':'r','с':'s','т':'t',
        'у':'u','ф':'f','х':'h','ц':'c','ч':'ch',
        'ш':'sh','щ':'sch','ъ':'','ы':'y','ь':'',
        'э':'e','ю':'yu','я':'ya'
    }

# шаблоны используемые в файле abbrev.py
abbrev_clean_words = {
        ' и ': '',
        ' в ': '',
        ' при ': '',
        ' на ': '',
        ' с ': '',
        ' по ': '',
    }

glasnye_letters = {'у','е','ы','а','о','э','я','и','ю'}